modm-ext/data.modm.io/docs/svd/header_stm32l152xdx.svd
        <register>
          <name>OR</name>
          <description>TIM option register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI1RMP</name>
              <description>TI1_RMP[1:0] bits (TIM Input 1 remap)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ETR_RMP</name>
              <description>ETR_RMP bit (TIM10/11 ETR remap)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TI1_RMP_RI</name>
              <description>TI1_RMP_RI bit (TIM10/11 Input 1 remap for Routing interface)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM10">
      <name>TIM11</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40011000</baseAddress>
      <interrupt>
        <name>TIM11</name>
        <description>TIM11 global Interrupt</description>
        <value>27</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012400</baseAddress>
      <interrupt>
        <name>ADC1</name>
        <description>ADC1 global Interrupt</description>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>ADC status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWD</name>
              <description>ADC analog watchdog 1 flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCS</name>
              <description>ADC group regular end of unitary conversion or end of sequence conversions flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS</name>
              <description>ADC group injected end of sequence conversions flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSTRT</name>
              <description>ADC group injected conversion start flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT</name>
              <description>ADC group regular conversion start flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR</name>
              <description>ADC group regular overrun flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADONS</name>
              <description>ADC ready flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCNR</name>
              <description>ADC group regular not ready flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JCNR</name>
              <description>ADC group injected not ready flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>ADC control register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWDCH</name>
              <description>ADC analog watchdog 1 monitored channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>EOCSIE</name>
              <description>ADC group regular end of unitary conversion or end of sequence conversions interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDIE</name>
              <description>ADC analog watchdog 1 interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOSIE</name>
              <description>ADC group injected end of sequence conversions interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCAN</name>
              <description>ADC scan mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC conversion is performed in unitary conversion mode (one channel converted, that defined in rank 1). Configuration of both groups regular and injected sequencers (sequence length, ...) is discarded: equivalent to length of 1 rank.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ADC conversions are performed in sequence conversions mode, according to configuration of both groups regular and injected sequencers (sequence length, ...).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>ADC analog watchdog 1 monitoring a single channel or all channels</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JAUTO</name>
              <description>ADC group injected automatic trigger mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <description>ADC group injected conversion trigger independent. Setting mandatory if ADC group injected injected trigger source is set to an external trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROM_GRP_REGULAR</name>
                  <description>ADC group injected conversion trigger from ADC group regular. Setting compliant only with group injected trigger source set to SW start, without any further action on ADC group injected conversion start or stop: in this case, ADC group injected is controlled only from ADC group regular.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCEN</name>
              <description>ADC group regular sequencer discontinuous mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JDISCEN</name>
              <description>ADC group injected sequencer discontinuous mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group injected sequencer discontinuous mode disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONT_1RANK</name>
                  <description>ADC group injected sequencer discontinuous mode enable with sequence interruption every rank</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCNUM</name>
              <description>ADC group regular sequencer discontinuous number of ranks</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PDD</name>
              <description>ADC power down during auto delay phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDI</name>
              <description>ADC power down during idle phase</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JAWDEN</name>
              <description>ADC analog watchdog 1 enable on scope ADC group injected</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDEN</name>
              <description>ADC analog watchdog 1 enable on scope ADC group regular</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RES</name>
              <description>ADC resolution</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESOLUTION_12B</name>
                  <description>ADC resolution 12 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_10B</name>
                  <description>ADC resolution 10 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_8B</name>
                  <description>ADC resolution 8 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESOLUTION_6B</name>
                  <description>ADC resolution 6 bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRIE</name>
              <description>ADC group regular overrun interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>ADC control register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADON</name>
              <description>ADC enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONT</name>
              <description>ADC group regular continuous conversion mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>ADC conversions are performed in single mode: one conversion per trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>ADC conversions are performed in continuous mode: after the first trigger, following conversions launched successively automatically</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>ADC channels bank selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A</name>
                  <description>ADC channels bank A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>ADC channels bank B, available in devices categories 3, 4, 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELS</name>
              <description>ADC auto delay selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>ADC low power mode auto wait not activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT</name>
                  <description>ADC low power mode auto wait: Dynamic low power mode, ADC conversions are performed only when necessary (when previous ADC conversion data is read). See description with function @ref LL_ADC_SetLowPowerModeAutoWait().</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_7_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 7 APB clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_15_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 15 APB clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_31_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 31 APB clock cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_63_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 63 APB clock cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_127_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 127 APB clock cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWAIT_255_APBCLOCKCYCLES</name>
                  <description>ADC low power mode auto wait: Insert a delay between ADC conversions: 255 APB clock cycles</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>ADC DMA transfer enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDS</name>
              <description>ADC DMA transfer configuration</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCS</name>
              <description>ADC end of unitary or end of sequence conversions selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQUENCE_CONV</name>
                  <description>ADC flag EOC (end of unitary conversion) selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNITARY_CONV</name>
                  <description>ADC flag EOS (end of sequence conversions) selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALIGN</name>
              <description>ADC data alignment</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>ADC conversion data alignment: right aligned (alignment on data register LSB bit 0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>ADC conversion data alignment: left aligned (alignment on data register MSB bit 15)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>ADC group injected external trigger source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>ADC group injected external trigger polarity</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>ADC group injected conversion trigger polarity set to rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>ADC group injected conversion trigger polarity set to falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISINGFALLING</name>
                  <description>ADC group injected conversion trigger polarity set to both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>ADC group injected conversion start</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>ADC group regular external trigger source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTEN</name>
              <description>ADC group regular external trigger polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>ADC group regular conversion trigger polarity set to rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>ADC group regular conversion trigger polarity set to falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISINGFALLING</name>
                  <description>ADC group regular conversion trigger polarity set to both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWSTART</name>
              <description>ADC group regular conversion start</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>ADC sample time register 1</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMP20</name>
              <description>ADC channel 20 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP21</name>
              <description>ADC channel 21 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP22</name>
              <description>ADC channel 22 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP23</name>
              <description>ADC channel 23 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP24</name>
              <description>ADC channel 24 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP25</name>
              <description>ADC channel 25 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP26</name>
              <description>ADC channel 26 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP27</name>
              <description>ADC channel 27 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP28</name>
              <description>ADC channel 28 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP29</name>
              <description>ADC channel 29 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
